In [1]:

import pandas as pd
import numpy as np

In [4]:
pd.options.display.max_rows=10

In [5]:
pd.options.display.max_rows=10

In [19]:
dates=pd.date_range('1/1/2000',periods=7)

In [18]:
list(dates)

[Timestamp('2000-01-01 00:00:00', freq='D'),
 Timestamp('2000-01-02 00:00:00', freq='D'),
 Timestamp('2000-01-03 00:00:00', freq='D'),
 Timestamp('2000-01-04 00:00:00', freq='D'),
 Timestamp('2000-01-05 00:00:00', freq='D'),
 Timestamp('2000-01-06 00:00:00', freq='D'),
 Timestamp('2000-01-07 00:00:00', freq='D')]

In [21]:
ts=pd.Series(np.arange(7),index=dates)

In [22]:
ts

2000-01-01    0
2000-01-02    1
2000-01-03    2
2000-01-04    3
2000-01-05    4
2000-01-06    5
2000-01-07    6
Freq: D, dtype: int32

In [23]:
obj = """
{"name": "Wes",
 "places_lived": ["United States", "Spain", "Germany"],
 "pet": null,
 "siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus", "Zuko"]},
              {"name": "Katie", "age": 38,
               "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [24]:
import json
result=json.loads(obj)

In [25]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [26]:
asjson=json.dumps(result)

In [27]:
result

{'name': 'Wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [30]:
siblings=pd.DataFrame(result['siblings'])

In [29]:
siblings

[{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
 {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]

In [31]:
siblings

    name  age                    pets
0  Scott   30            [Zeus, Zuko]
1  Katie   38  [Sixes, Stache, Cisco]

In [33]:
data=pd.read_json('example.json')

In [34]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [36]:
print(data.to_json())

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}

In [37]:
print(data.to_json(orient='records'))

[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

In [ ]:
tables = pd.read_html('/Users/sudhanshukumar/Downloads/examples/'fdic_failed_bank_list.html'')
len(tables)
failures = tables[0]
failures.head()

In [38]:
tables=pd.read_html('fdic_failed_bank_list.html')

In [39]:
len(tables)

1

In [41]:
failures=tables[0]

In [42]:
failures.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Allied Bank,Mulberry,AR,91,Today's Bank,"September 23, 2016","November 17, 2016"
1,The Woodbury Banking Company,Woodbury,GA,11297,United Bank,"August 19, 2016","November 17, 2016"
2,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","September 6, 2016"
3,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","September 6, 2016"
4,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016"

In [43]:
closingdate=pd.to_datetime(failures['Closing Date'])

In [49]:
closingdate.dt.year.value_counts()

2010    157
2009    140
2011     92
2012     51
2008     25
       ...
2004      4
2001      4
2007      3
2003      3
2000      2
Name: Closing Date, Length: 15, dtype: int64

In [50]:

frame=pd.read_csv('ex1.csv')
frame

In [51]:
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [52]:
frame.to_pickle('frame_pickle')

In [54]:
pd.read_pickle('frame_pickle')

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [75]:
#frame = pd.DataFrame({'a': np.random.randn(100)})
#store = pd.HDFStore('mydata.h5')
#store['obj1'] = frame
#store['obj1_col'] = frame['a']
#store
frame=pd.DataFrame({'a':np.random.randn(100)})
store=pd.HDFStore('myhdf.h5')
#store['ob']=frame
#store['ob_cl']=frame['a']

In [58]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: myhdf.h5

In [59]:
store['ob_cl']

0     0.001932
1    -0.779594
2    -0.495191
3    -1.005383
4     1.243522
        ...
95    0.797253
96    0.109696
97   -0.402474
98   -0.524560
99    1.484577
Name: a, Length: 100, dtype: float64

In [60]:
frame

           a
0   0.001932
1  -0.779594
2  -0.495191
3  -1.005383
4   1.243522
..       ...
95  0.797253
96  0.109696
97 -0.402474
98 -0.524560
99  1.484577

[100 rows x 1 columns]

In [62]:
frame3=pd.DataFrame({'b':np.arange(10)})

In [81]:
store.put('obj2', frame3, format='table')
store.select('obj2', where=['index >= 3 and index <= 7'])
store.close()

In [71]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: myhdf.h5

In [76]:
frame3.to_hdf('myhdf.h5','obj3',format='table')

In [82]:
pd.read_hdf('myhdf.h5','obj3',where=['index<5'])

ValueError: The file 'myhdf.h5' is already opened, but not in read-only mode (as requested).

In [83]:
import requests

In [84]:
url='https://api.github.com/repos/pandas-dev/pandas/issues'

In [86]:
resp=requests.get(url)

In [89]:
resp

In [90]:
data=resp.json()

In [100]:
data[0]['user']

{'login': 'jreback',
 'id': 953992,
 'node_id': 'MDQ6VXNlcjk1Mzk5Mg==',
 'avatar_url': 'https://avatars2.githubusercontent.com/u/953992?v=4',
 'gravatar_id': '',
 'url': 'https://api.github.com/users/jreback',
 'html_url': 'https://github.com/jreback',
 'followers_url': 'https://api.github.com/users/jreback/followers',
 'following_url': 'https://api.github.com/users/jreback/following{/other_user}',
 'gists_url': 'https://api.github.com/users/jreback/gists{/gist_id}',
 'starred_url': 'https://api.github.com/users/jreback/starred{/owner}{/repo}',
 'subscriptions_url': 'https://api.github.com/users/jreback/subscriptions',
 'organizations_url': 'https://api.github.com/users/jreback/orgs',
 'repos_url': 'https://api.github.com/users/jreback/repos',
 'events_url': 'https://api.github.com/users/jreback/events{/privacy}',
 'received_events_url': 'https://api.github.com/users/jreback/received_events',
 'type': 'User',
 'site_admin': False}

In [101]:
#issues=pd.DataFrame(data,columns=['a','b','c','d'])
issues = pd.DataFrame(data, columns=['number', 'title',
                                     'labels', 'state'])

In [102]:
issues

,number,title,labels,state
0,33747,CI not running linux / windows builds,"[{'id': 48070600, 'node_id': 'MDU6TGFiZWw0ODA3...",open
1,33746,QST: Does ExcelWriter accept a file object? Wh...,"[{'id': 1954720290, 'node_id': 'MDU6TGFiZWwxOT...",open
2,33745,BUG: support skew function for custom BaseInde...,"[{'id': 1045950827, 'node_id': 'MDU6TGFiZWwxMD...",open
3,33743,pandas boxplot props not working,[],open
4,33742,DOC:,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open
...,...,...,...,...
25,33715,BUG: DTI/TDI/PI.where accepting incorrectly-ty...,"[{'id': 76811, 'node_id': 'MDU6TGFiZWw3NjgxMQ=...",open
26,33714,CLN: simplify DTA.__getitem__,[],open
27,33712,TST: more accurate expecteds for DTI/TDI,[],open
28,33711,TST: prepare for freq-checking in tests.io,[],open
29,33709,Improve to_parquet documentation,"[{'id': 134699, 'node_id': 'MDU6TGFiZWwxMzQ2OT...",open

In [104]:
import sqlite3

In [107]:
db=sqlite3.connect("sqlite.db")

In [108]:
db.execute("drop table if exists grade1")

In [109]:
db.execute("create table grade1(id int,name text,score int)")

In [110]:
db.execute("insert into grade1 values(101,'bala',99)")

In [111]:
db.execute("insert into grade1 values(102,'chandra',89)")

In [112]:
db.execute("insert into grade1 values(103,'kranthi',97)")

In [113]:
db.execute("insert into grade1 values(104,'kiran',97)")

In [114]:
db.commit()

In [119]:
results=db.execute("select * from grade1 order by id")
for i in results:
    print(i)
print('-'*25)

(101, 'bala', 99)
(102, 'chandra', 89)
(103, 'kranthi', 97)
(104, 'kiran', 97)
-------------------------

In [120]:
kiran=db.execute("select * from grade1 where name='kiran'")

In [121]:
for i in kiran:
    print(i)

(104, 'kiran', 97)

In [2]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [4]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')

In [5]:
titanic_train.tail(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [6]:
titanic_train.shape

(156, 12)

In [7]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [8]:
pd.options.display.max_rows=20

In [9]:
titanic_train.describe()#statistic about numerical data

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [10]:
titanic_train[['Name','Sex','Cabin']].describe()

                                     Name   Sex Cabin
count                                 156   156    31
unique                                156     2    28
top     Andersson, Miss. Ellis Anna Maria  male   D26
freq                                    1   100     2

In [15]:
a=titanic_train.dtypes[titanic_train.dtypes=="object"].index

In [12]:
titanic_train.select_dtypes(include='object').describe()

                                     Name   Sex Ticket Cabin Embarked
count                                 156   156    156    31      155
unique                                156     2    145    28        3
top     Andersson, Miss. Ellis Anna Maria  male   2651   D26        S
freq                                    1   100      2     2      110

In [16]:
type(titanic_train.dtypes)

pandas.core.series.Series

In [17]:
a

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [147]:
titanic_train[a].describe()

,Name,Sex,Ticket,Cabin,Embarked
count,156,156,156,31,155
unique,156,2,145,28,3
top,"Andersson, Mr. August Edvard (""Wennerstrom"")",male,237736,C123,S
freq,1,100,2,2,110

In [18]:
del titanic_train['PassengerId']

In [19]:
titanic_train.select_dtypes(include='object')

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [20]:
titanic_train.select_dtypes(include='object')

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
151,"Pears, Mrs. Thomas (Edith Wearne)",female,113776,C2,S
152,"Meo, Mr. Alfonzo",male,A.5. 11206,NaN,S
153,"van Billiard, Mr. Austin Blyler",male,A/5. 851,NaN,S
154,"Olsen, Mr. Ole Martin",male,Fa 265302,NaN,S
155,"Williams, Mr. Charles Duane",male,PC 17597,NaN,C

In [21]:
sorted(titanic_train['Name'])[0:10]

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [152]:
type((titanic_train['Name']))

pandas.core.series.Series

In [22]:
titanic_train['Survived']

0      0
1      1
2      1
3      1
4      0
      ..
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [23]:
pd.Categorical(titanic_train['Survived'])

[0, 1, 1, 1, 0, ..., 1, 0, 0, 0, 0]
Length: 156
Categories (2, int64): [0, 1]

In [25]:
new_survived=pd.Categorical(titanic_train['Survived'])

In [27]:
new_survived

[0, 1, 1, 1, 0, ..., 1, 0, 0, 0, 0]
Length: 156
Categories (2, int64): [0, 1]

In [28]:
new_survived=new_survived.rename_categories(['Died','Survived'])

In [29]:
new_survived

[Died, Survived, Survived, Survived, Died, ..., Survived, Died, Died, Died, Died]
Length: 156
Categories (2, object): [Died, Survived]

In [31]:
new_pclass=pd.Categorical(titanic_train['Pclass'])

In [33]:
new_pclass=new_pclass.rename_categories(['c1','c2','c3'])

In [32]:
new_pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [34]:
new_pclass

[c3, c1, c3, c1, c3, ..., c1, c3, c3, c3, c1]
Length: 156
Categories (3, object): [c1, c2, c3]

In [35]:
titanic_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [36]:
titanic_train["new_survived"]=new_survived

In [37]:
titanic_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_survived
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Died
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Survived
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Survived
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Survived
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Died

In [179]:
titanic_train.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_survived
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Died
1,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,Survived
2,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,Survived
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Survived
4,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,Died

In [38]:
titanic_train['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [39]:
titanic_train.dtypes

Survived           int64
Pclass             int64
Name              object
Sex               object
Age              float64
SibSp              int64
Parch              int64
Ticket            object
Fare             float64
Cabin             object
Embarked          object
new_survived    category
dtype: object

In [40]:
char_cabin=titanic_train['Cabin'].astype(str)

In [41]:
type(char_cabin)

pandas.core.series.Series

In [42]:
new_cabin=np.array([cabin[0] for cabin in char_cabin])
type(new_cabin)

numpy.ndarray

In [43]:
new_cabin=pd.Categorical(new_cabin)

In [189]:
new_cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [44]:
dummy_vector=pd.Series([1,None,3,None,7,8])

In [46]:
dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [47]:
missing=np.where(titanic_train['Age'].isnull()==True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [49]:
titanic_train.loc[missing][['Name','Survived','Age']]

                              Name  Survived  Age
5                 Moran, Mr. James         0  NaN
17    Williams, Mr. Charles Eugene         1  NaN
19         Masselmani, Mrs. Fatima         1  NaN
26         Emir, Mr. Farred Chehab         0  NaN
28   O'Dwyer, Miss. Ellen "Nellie"         1  NaN
..                             ...       ...  ...
121     Moore, Mr. Leonard Charles         0  NaN
126            McMahon, Mr. Martin         0  NaN
128              Peter, Miss. Anna         1  NaN
140  Boulos, Mrs. Joseph (Sultana)         0  NaN
154          Olsen, Mr. Ole Martin         0  NaN

[30 rows x 3 columns]

In [204]:
titanic_train["Fare"]==max(titanic_train['Fare'])

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154    False
155    False
Name: Fare, Length: 156, dtype: bool

In [50]:
maxfare=np.where(titanic_train["Fare"]==max(titanic_train['Fare']))
maxfare

(array([27, 88], dtype=int64),)

In [51]:
maxfare

(array([27, 88], dtype=int64),)

In [52]:
indexmaxfare=np.where(titanic_train["Fare"]==max(titanic_train['Fare']))

In [53]:
titanic_train.loc[indexmaxfare]['Name']

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [54]:
titanic_train.loc[0:10:3]

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new_survived
0,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,Died
3,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,Survived
6,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S,Died
9,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C,Survived

april-11

In [56]:
import pandas as pd
import numpy as np

In [62]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
#pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [65]:
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [66]:
arr

array([10, 20, 30])

In [67]:
type(arr)

numpy.ndarray

In [71]:
a=pd.Series(arr,index=labels)

In [72]:
a

a    10
b    20
c    30
dtype: int32

In [75]:
a['a']

10

In [76]:
a[0]

10

In [79]:
a[0:2]

a    10
b    20
dtype: int32

In [80]:
d={'a':1,'b':2,'c':3}

In [99]:
pd.DataFrame(d,index=d.keys())

   a  b  c
a  1  2  3
b  1  2  3
c  1  2  3

In [81]:
d.keys()

dict_keys(['a', 'b', 'c'])

In [82]:
d.items()

dict_items([('a', 1), ('b', 2), ('c', 3)])

In [86]:
pd.DataFrame(d,index=[10])

    a  b  c
10  1  2  3

In [87]:
pd.Series([type,sum,max])

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [88]:
print(pd.Series([type,sum,max]))

0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [89]:
ser1=pd.Series([1,2,3,4],index=['a','b','v','d'])

In [90]:
ser1

a    1
b    2
v    3
d    4
dtype: int64

In [92]:
ser1[0:3:2]

a    1
v    3
dtype: int64

In [95]:
ser2=pd.Series([10,20,30,40],index=['a','bd','v','dv'])

In [96]:
ser1+ser2

a     11.0
b      NaN
bd     NaN
d      NaN
dv     NaN
v     33.0
dtype: float64

In [97]:
ser1*ser2

a     10.0
b      NaN
bd     NaN
d      NaN
dv     NaN
v     90.0
dtype: float64

In [3]:
from numpy.random import randn as n

In [102]:
#normal distribution - statistics..
#randn - generated random values

In [4]:
matrix_data=np.random.randn(5,4)

In [7]:
type(matrix_data)

numpy.ndarray

In [5]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df=pd.DataFrame(matrix_data,row_labels,column_headings)

In [9]:
df

          W         X         Y         Z
A -0.222642 -0.927029 -2.565511  1.302558
B  0.184893 -0.755800 -0.427253  1.880220
C -1.304189 -0.029512 -1.392208  1.064396
D -0.747416 -0.164205 -0.710395 -1.289800
E  0.090463  0.931397  0.145444  0.286016

In [11]:
df.loc['C']

W   -1.304189
X   -0.029512
Y   -1.392208
Z    1.064396
Name: C, dtype: float64

In [12]:
#iloc always ectract info from integer,it always gives data from the original index only

In [13]:
#loc, always extract data from the named index

In [14]:
df.loc['D']

W   -0.747416
X   -0.164205
Y   -0.710395
Z   -1.289800
Name: D, dtype: float64

In [16]:
df.iloc[3]

W   -0.747416
X   -0.164205
Y   -0.710395
Z   -1.289800
Name: D, dtype: float64

In [27]:
df['New']=df['X']+df['Y']

In [19]:
print(df)

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
C -1.304189 -0.029512 -1.392208  1.064396 -1.421719
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [28]:
df

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
C -1.304189 -0.029512 -1.392208  1.064396 -1.421719
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [21]:
df.drop('C')

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [25]:
df

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [29]:
df.drop('C',inplace=True) #axis=0 is for index/row, axis=1 for column

In [30]:
df

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [32]:
df.drop('Y',axis=1)

          W         X         Z       New
A -0.222642 -0.927029  1.302558 -3.492540
B  0.184893 -0.755800  1.880220 -1.183052
D -0.747416 -0.164205 -1.289800 -0.874601
E  0.090463  0.931397  0.286016  1.076841

In [33]:
df

          W         X         Y         Z       New
A -0.222642 -0.927029 -2.565511  1.302558 -3.492540
B  0.184893 -0.755800 -0.427253  1.880220 -1.183052
D -0.747416 -0.164205 -0.710395 -1.289800 -0.874601
E  0.090463  0.931397  0.145444  0.286016  1.076841

In [34]:
df.drop('Y',axis=1,inplace=True)

In [35]:
df

          W         X         Z       New
A -0.222642 -0.927029  1.302558 -3.492540
B  0.184893 -0.755800  1.880220 -1.183052
D -0.747416 -0.164205 -1.289800 -0.874601
E  0.090463  0.931397  0.286016  1.076841

In [37]:
df

          W         X         Y         Z
A -0.222642 -0.927029 -2.565511  1.302558
B  0.184893 -0.755800 -0.427253  1.880220
C -1.304189 -0.029512 -1.392208  1.064396
D -0.747416 -0.164205 -0.710395 -1.289800
E  0.090463  0.931397  0.145444  0.286016

In [43]:
df.iloc[3] #iloc -- original index or default index

W   -0.747416
X   -0.164205
Y   -0.710395
Z   -1.289800
Name: D, dtype: float64

In [42]:
df.iloc[[0,2],[0,2]]

          W         Y
A -0.222642 -2.565511
C -1.304189 -1.392208

In [46]:
df.iloc[[1,3],[1,2]]

          X         Y
B -0.755800 -0.427253
D -0.164205 -0.710395

In [47]:
df.iloc[:,[1,2]]

          X         Y
A -0.927029 -2.565511
B -0.755800 -0.427253
C -0.029512 -1.392208
D -0.164205 -0.710395
E  0.931397  0.145444

In [52]:
df.iloc[0:3,1::2]# we can give step size also by using colon

          X         Z
A -0.927029  1.302558
B -0.755800  1.880220
C -0.029512  1.064396

In [58]:
df.loc[['A','B'],['X','Z']] #loc is named index

          X         Z
A -0.927029  1.302558
B -0.755800  1.880220

In [59]:
df.ix[4]

C:\Users\BALACHANDRA\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

W    0.090463
X    0.931397
Y    0.145444
Z    0.286016
Name: E, dtype: float64

In [60]:
df.ix["E"] #ix is combination of loc and iloc

C:\Users\BALACHANDRA\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

W    0.090463
X    0.931397
Y    0.145444
Z    0.286016
Name: E, dtype: float64

In [61]:
df.ix[0:3,0:3]

C:\Users\BALACHANDRA\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.
C:\Users\BALACHANDRA\Anaconda3\lib\site-packages\pandas\core\indexing.py:822: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  retval = getattr(retval, self.name)._getitem_axis(key, axis=i)

          W         X         Y
A -0.222642 -0.927029 -2.565511
B  0.184893 -0.755800 -0.427253
C -1.304189 -0.029512 -1.392208

In [66]:
row_labels = [2,3,5,6,7]
column_headings = ['W','X','Y','Z']
#np.random.seed(101)
df=pd.DataFrame(matrix_data,row_labels,column_headings)

In [64]:
df

          W         X         Y         Z
2 -0.222642 -0.927029 -2.565511  1.302558
3  0.184893 -0.755800 -0.427253  1.880220
5 -1.304189 -0.029512 -1.392208  1.064396
6 -0.747416 -0.164205 -0.710395 -1.289800
7  0.090463  0.931397  0.145444  0.286016

In [67]:
df.ix[2]#ix will extract data on priority to labelbased.. so better to use iloc/loc

C:\Users\BALACHANDRA\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: FutureWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

W   -0.222642
X   -0.927029
Y   -2.565511
Z    1.302558
Name: 2, dtype: float64

In [69]:
df>0

       W      X      Y      Z
2  False  False  False   True
3   True  False  False   True
5  False  False  False   True
6  False  False  False  False
7   True   True   True   True

In [2]:
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
#np.random.seed(101)
df=pd.DataFrame(matrix_data,row_labels,column_headings)

NameError: name 'matrix_data' is not defined

In [77]:
df[df>0]

          W         X         Y         Z
A       NaN       NaN       NaN  1.302558
B  0.184893       NaN       NaN  1.880220
C       NaN       NaN       NaN  1.064396
D       NaN       NaN       NaN       NaN
E  0.090463  0.931397  0.145444  0.286016

In [83]:

import pandas as pd 
import numpy as np
matrix_data= np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [84]:
df=pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)

In [88]:
df[(df['Age']>25)&(df['Height']>65)]

   Age  Height  Weight
B   42      70     148
D   35      68     160

In [90]:
df.reset_index() #drop is false normally.. but you can modify it as True to remove existing index

  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [91]:
df.reset_index(drop=True)

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [92]:
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [93]:
profe='doctor teacher teacher scientist softwareengineer'

In [94]:
df['pro']=profe.split()

In [95]:
df

   Age  Height  Weight               pro
A   22      66     140            doctor
B   42      70     148           teacher
C   30      62     125           teacher
D   35      68     160         scientist
E   25      62     152  softwareengineer

In [97]:
df.set_index('pro')

                  Age  Height  Weight
pro
doctor             22      66     140
teacher            42      70     148
teacher            30      62     125
scientist          35      68     160
softwareengineer   25      62     152

In [104]:
df[df['Age']>25].shape[0]

3

In [6]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
#hier_index = list(zip(outside,inside))

In [7]:
hier_index=list(zip(outside,inside))

In [10]:
for i in hier_index:
    print(i)

('G1', 1)
('G1', 2)
('G1', 3)
('G2', 1)
('G2', 2)
('G2', 3)

In [13]:
pd.MultiIndex.from_tuples(hier_index)

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [14]:
hier_m_index=pd.MultiIndex.from_tuples(hier_index)

In [19]:
df1=pd.DataFrame(data=np.random.randn(6,3),index=hier_m_index,columns=['A','B','C'])

In [20]:
df1

             A         B         C
G1 1 -0.001471 -0.221190 -0.830747
   2  0.178907 -0.220663  0.096912
   3  2.049200 -0.707008 -0.944836
G2 1  0.195933  1.040497  1.355028
   2  0.362339 -0.349045 -0.716597
   3 -2.401881  0.293546  0.185151

In [25]:
df1.loc['G1'].loc[3]['C']

-0.9448361590333113

In [27]:
df1.loc['G2'].loc[[2,3],['B','C']]

          B         C
2 -0.349045 -0.716597
3  0.293546  0.185151